def valid_ipv4?(ip)
  # Регулярний вираз для перевірки формату IPv4 без ведучих нулів
  ipv4_regex = /\A(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]|[0-9])\.
                 (25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]|[0-9])\.
                 (25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]|[0-9])\.
                 (25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9][0-9]|[0-9])\z/x

  # Перевірка відповідності рядка регулярному виразу
  !!(ip =~ ipv4_regex)
end

puts valid_ipv4?("192.168.1.1")
puts valid_ipv4?("255.255.255.255")
puts valid_ipv4?("256.100.50.25")
puts valid_ipv4?("01.02.03.04")
puts valid_ipv4?("192.168.1")
puts valid_ipv4?("10.0.0.0")